<?php

namespace Database\Seeders;

use App\Models\Answer;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class AnswerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $columns = ['keyword', 'name'];
        $items = [
            ['ပဲတီစိမ်း','ပဲတီစိမ်းသည် မတ်ပဲနှင့် နှိုင်းယှဉ်လျှင် စိုထိုင်းဆနှင့် ရေငတ်ဒဏ်ခံနိုင်ရည်ရှိမှု နည်းပါသည်။ ပူနွေးခြောက်သွေ့သော ရာသီဥတုကို ကြိုက်နှစ်သက်ပါသည်။ ပဲတီစိမ်းဖြစ်ထွန်းရန် လိုအပ်သည့်အပူချိန်မှာ(၃၀-၃၆)ဒီဂရီစင်တီဂရိတ် ဖြစ်ပါသည်။ မိုးရွာသွန်းမှုညီမျှ၍ တစ်နှစ်ပျမ်းမျှမိုးရေချိန် (၃၀မှ၃၆)လက်မအတွင်း ရှိရန်လိုအပ်ပါသည်။ ပဲတီစိမ်းကို ပင်လယ်ရေမျက်ပြင်အထက် ပေ (၆၀၀၀)အထိ စိုက်ပျိုးနိုင်ပါသည်။ ဝတ်မှုံကူးခြင် း(၆-၈)ပတ် အကြာ၌ပန်းစတင်၍ပွင့်သည်။ ပန်းပွင့်မအာမီ တစ်ရက်အလို ညနေဘက်တွင် အငုံထဲ၌ပင် ဝတ်မှုံရင့်ကြွေ၍ မျျိုးကူးစပ်မှုပြီးစီးသည်။လုံးဝပင်တည်းဝတ်မှုံကူးပင် ဖြစ်ပါသည်။ ပွင့်အာခြင်း မရှိတော့ဘဲ ဝတ်မှုံကူးသည့် ပန်းပွင့်များ ရာခိုင်နှုန်ုး(၄၀)ကျော်သည်။ အပူချိန်နှစ်စဉ်ပျမ်းမျှ (၈)ဒီဂရီစင်တီဂရိတ်အောက် မကျသောဒေသနှင့်ပျမ်းမျှ(၂၀)ဒီဂရီစင်တီဂရိတ်ထက် မပိုသောဒေသများတွင် ပို၍ဖြစ်ထွန်းနိုင်သည်။ စိုက်ပျိုးချိန်ကာလအတွင်း အနိမ့်ဆုံး(၁၅) ဒီဂရီစင်တီဂရိတ်မကျဘဲ အမြင့်ဆုံး(၃၂)ဒီဂရီစင်တီဂရိတ်ထက်မကျော်သင့်ပေ။ အသင့်တော်ဆုံးမှ ာ(၂၅-၃၀)ဒီဂရီစင်တီဂရိတ်အတွင်းဖြစ်သည်။ '],
            ['ပဲစင်းငုံ', 'ပဲစင်းငုံသီးနှံ ကိုအပူပိုင်းနှင့်အပူသမပိုင်းနိုင်ငံများတွင် စိုက်ပျိုးကြပါသည်။ပဲစင်းငုံပင်သည် နှစ်ရှည်ခြုံပင်မျိုးဖြစ်သော်လည်း တစ်နှစ်ခံသီးနှံပင်အဖြစ် စိုက်ပျိုးလေ့ရှိပါသည်။ပဲစင်းငုံကို မိုးသီးနှံအဖြစ် အထက်မြန်မာပြည် အပူပိုင်းခြောက်သွေ့ဒေသများဖြစ်သည့် မန္တလေးတိုင်း၊ စစ်ကိုင်းတိုင်း၊ မကွေးတိုင်းတို့တွင် အများဆုံးစိုက်ပျိုးကြပါသည်။ မြန်မာနိုင်ငံတွင် အများဆုံးစိုက်ပျိုးကြသည့် ပဲစင်းငုံမျိုးများမှာ သက်ကြီးမျိုးများဖြစ်၍ အသက်ရက်(၂၇၅)ရက်ခန့် ရှိပါသည်။သို့ဖြစ်ပါ၍ ပဲစင်းငုံစိုက်ပျိုးဧရိယာ၏ (၉၀)%အထက်မှာ သီးညှပ်သီးနှံအဖြစ်စိုက်ပျိုးကြပါသည်။ (၂၀၂၁-၂၀၂၂)ခုနှစ်တွင် (၁၀၆၁၉၉၈)ဧက စိုက်ပျိုးပြီး(၁၄၄၅၃၈၄၀) တင်းထွက်ရှိခဲ့ပါသည်။'],
            ['ပဲပုပ်', 'ပဲပုပ်သီးနှံသည် Glycine ussriensis မျိုးစိတ်မှ ဆင်းသက်လာသည်။ ပဲပုပ်သီးနှံ၏ မူရင်းဒေသမှာ အရှေ့တောင်အာရှဖြစ်ပြီး တရုတ်နှင့် ဂျပန်နိုင်ငံတွင် မျိုးရိုင်းများကို စိုက်ပျိုးသည်။ ပဲပုပ်မျိုးများစွာရှိပါသည်။ ၎င်း၏သက်တမ်းကာလကိုလိုက်၍ မျိုးအုပ်စု(၁၀) စုခွဲခြားထားပါသည်။ မြန်မာနိုင်ငံတွင် ပဲပုပ်သီးနှံကို ပြည်တွင်းစားသုံးရန်နှင့် ပြည်ပသို့ ဆီထွက်သီးနှံအဖြစ် တင်ပို့လျှက်ရှိသောသီးနှံတစ်ခုဖြစ်ပါသည်။ ပဲပုပ်ကို ပဲငပိဟုလည်း ခေါ်ကြသည်။ (၁၉၆၅)ခုနှစ်၊ တက္ကသိုလ်ဝင်စိုက်ပျိုးရေးပညာစာအုပ်(စာပေဗိမာန်ထုတ်)တွင် ပဲငပိ(Soy Bean)ဟု ဖော်ပြထားပါသည်။ ပဲပုပ်သီးနှံသည် အာဟာရနှင့် စီးပွားရှု့ထောင့်အရ တန်ဖိုးရှိ၍ အရေးပါသည့် ပဲမျိုးစုံသီးနှံတစ်ခုဖြစ်ပါသည်။ အသားဓါတ်ခေါ် ပရိုတိန်း(၄၀-၄၅)ရာခိုင်နှုန်းနှင့် ဟင်းသီးဟင်းရွက်ဆီ (၁၉-၂၀)ရာခိုင်နှုန်းပါဝင်ပါသည်။ ပဲပုပ်ဆီသည် ကမ္ဘာ့ထိပ်တန်းနေရာတွင်ရှိသည့် ဟင်းသီးဟင်းရွက်ဆီ တစ်မျိုးဖြစ်ပါသည်။ ပဲပုပ်သည် ရှေးအကျဆုံး စားသုံးသီးနှံဖြစ်ပြီး ယနေ့ခေတ်တွင် အသုံး၀င်ဆုံးသီးနှံအဖြစ်အောင်မြင်မှုရလျှက်ရှိပါသည်။ ပဲပုပ်အဓိကစိုက်ပျိုးသည့်ဒေသမှာ ရှမ်းပြည်နယ်ဖြစ်၍ တစ်နိုင်ငံလုံးစိုက်ဧက၏ (၅၀)ရာခိုင်နှုန်း စိုက်ပျိုးပါသည်။ ကျန်ရှိဧရိယာများကို မန္တလေး၊ စစ်ကိုင်း၊ဧရာဝတီနှင့် ပဲခူးတိုင်းဒေသကြီးနှင့်    ကချင်ပြည်နယ်တို့တွင် အများဆုံးစိုက်ပျိုးကြပါသည်။ ရှမ်းပြည်နယ်တွင် သီးသန့်သော်လည်းကောင်း၊ သီးညှပ်သီးနှံအဖြစ်လည်းကောင်း၊ အစေ့ထုတ်ပြောင်း၊ နေကြာသီးနှံတို့နှင့် ညှပ်၍ စိုက်ပျိုးကြပါသည်။ အောက်မြန်မာနိုင်ငံတွင် မြစ်ရေကျချိန် ကိုင်းကျွန်းမြေများ၌ စိုက်ပျိုးကြပါသည်။ ပဲပုပ်သီးနှံသည် တစ်ရာသီခံပင်ဖြစ်ပြီး ပင်တည်းဝတ်မှုံကူးသော အပင်အမျိုးအစားလည်း ဖြစ်ပါသည်။ ပဲပုပ်သီးနှံကို တောင်ပေါ်ဒေသတွင် မေလနှင့် ဇွန်လ၊ မြေပြန့်ဒေသတွင် ဩဂုတ်လနှင့် စက်တင်ဘာလ ၊မြစ်ရေကျသည့် ကိုင်းကျွန်းမြေများတွင် အောက်တိုဘာလ၊စပါးအပြီး သီးထပ်စိုက်ပျိုးလျှင် နိုဝင်ဘာလအတွင်း စိုက်ပျိုးသည်။ မြန်မာနိုင်ငံမှ ပဲပုပ်ကို(၂၀၂၁-၂၀၂၂)ခုနှစ် စိုက်ပျိုးမှုများမှာ (၃၂၁၄၃၈)ဧကထိ စိုက်ပျိုးနိုင်ခဲ့ပါသည်။ '],
            ['နှံစားပြောင်း', '၂၀၂၀-၂၀၂၁ ခုနှစ်စိုက်ပျိုးရာသီတွင် နှံစားပြောင်း(Sorghum) သီးနှံအား ကချင်ပြည်နယ်၊ ကယားပြည်နယ်၊ ချင်းပြည်နယ်၊ ရှမ်းပြည်နယ်၊ မကွေးတိုင်းဒေသကြီး၊ စစ်ကိုင်းတိုင်းဒေသကြီး နှင့် မန္တလေးတို်ငးဒေသကြီးတို့တွင် စိုက်ပျိုးကြပြီး အထူးသဖြင့် စစ်ကိုင်းတိုင်းဒေသကြီး တွင် စိုက်ဧက (၁.၃) သိန်း ကျော်နှင့် မန္တလေးတိုင်းဒေသကြီးတွင်စိုက်ဧက (၁.၆) သိန်းကျော်စိုက်ပျိုးပါသည်။ ပြည်ထောင်စုချုပ် အနေဖြင့် စိုက်ဧက (၃.၉)သိန်းကျော် စိုက်ပျိုးပြီး တစ်ဧကပျမ်းမျှအထွက်နှုန်း (၁၃.၁၈) တင်းနှုန်းဖြင့် စုစုပေါင်း အထွက်တင်း (၅၁.၈)သိန်းကျော် ထွက်ရှိခဲ့ပါသည်။ နှံစားသီးနှံများအနက် တတိယအများဆုံးစိုက်ပျိုးသည့် သီးနှံဖြစ်ပါသည်။ '],
            ['လူး၊ဆပ်', 'မြန်မာနိုင်ငံတွင် လူးသီးနှံကိုအဓိကအားဖြင့် ကချင်ပြည်နယ်နှင့် စစ်ကိုင်းတိုင်းတို့တွင် စိုက်ပျိုးကြပြီး ဆပ်သီးနှံကို ကယားပြည်နယ်၊ချင်းပြည်နယ်နှင့် မကွေးတိုင်းဒေသကြီးနှင့် မန္တလေးတိုင်းဒေသကြီးတို့တွင် စိုက်ပျိုးကြသည်။ ချင်းပြည်နယ်တွင် အများဆုံးစိုက်ပျိုးပြီး ကျန်ဒေသများတွင် အနည်းငယ်သာ စိုက်ပျိုးကြသည်။ လူးသီးနှံအနေဖြင့် ဒေသမျိုးများဖြင့်သာ စိုက်ပျိုးကြပါသည်။ ဆပ်သီးနှံအနေဖြင့် ဆပ်နီ၊ဆပ်ဝါနှင့် ဒေသမျိုးများ စိုက်ပျိုးကြပါသည်။  လူး/ဆပ်သည် ကမ္ဘာပေါ်တွင် ရှေးအကျဆုံး စိုက်ပျိုးသော ကောက်ပဲသီးနှံများအနက်မှ တစ်ခုဖြစ်သည်။ အာဖရိကနှင့် အရှေ့တောင်အာရှတွင် နှစ်ထောင်ပေါင်းများစွာ စိုက်ပျိုးလာခဲ့ကြသည်။ ကမ္ဘာတဝှမ်းတွင် ထုတ်လုပ်မှုတန်ချိန် (၂၉.၇သန်းကျော်) ရှိ၏သည့်အနက် အိန္ဒိယနိုင်ငံတွင် ကမ္ဘာတွင်အများဆုံး စိုက်ပျိုးထုတ်လုပ်သော နိုင်ငံဖြစ်ပြီး ၎င်းနောက်တွင် နိုင်ဂျီးရီးယားသည် ဒုတိယအများဆုံးစိုက်ပျိုးသော နိုင်ငံဖြစ်သည်။ နိုင်ဂျာနိုင်ငံသည် တတိယအများဆုံးထုတ်လုပ်သော နိုင်ငံဖြစ်သည်။'],
            ['ဆန်စပါး', 'မြန်မာနိုင်ငံသည် ဆန်စပါး၏ မူလအစတစ်ခုဖြစ်သည်။ မြန်မာနိုင်ငံတွင် စပါးကို သမိုင်းမတင်မီကတည်းက စိုက်ပျိုးခဲ့သည်။ စူးအက်တူးမြောင်းကို ၁၈၆၉ ခုနှစ်တွင် ဖွင့်လှစ်ခဲ့ခြင်းကြောင့် ကုန်စည်ကူးသန်းရောင်းဝယ်မှု အားကောင်းခဲ့ပြီး မြန်မာနိုင်ငံတွင် အထူးသဖြင့် မြန်မာနိုင်ငံအောက်ပိုင်း၌ ဆန်စပါးစိုက်ပျိုးမှု ကျယ်ပြန့်လာခဲ့သည်။ စပါးဧရိယာသည် တဖြည်းဖြည်း ကျယ်ပြန့်လာပြီး ဒုတိယကမ္ဘာစစ် မတိုင်မီကပင် ဟက်တာ ၅ သန်းအထိ ရှိလာခဲ့သည်။ မြန်မာနိုင်ငံသည် နှစ်စဉ် ဆန်တန်ချိန် ၃ သန်း တင်ပို့ပြီး ကမ္ဘာပေါ်တွင် ဆန်အများဆုံး တင်ပို့သူ ဖြစ်လာခဲ့သည်။']
        ];

        foreach ($items as $item) {
            Answer::create(array_combine($columns, $item));
        }
    }
}
